# Dataframes

Dataframes represent tabular, 2-dimensional data, and provide a number of facilities for manipulating and transforming the data.

- Dataframes are made of pandas Series
- Dataframes also have some additional functionality, since they're the containers for dataframes

In [1]:
import pandas as pd

In [2]:
# List of dictionaries? Time to turn this into a pandas dataframe!
books = [
    {
        "title": "Genetic Algorithms and Machine Learning for Programmers",
        "price": 36.99,
        "author": "Frances Buontempo"
    },
    {
        "title": "The Visual Display of Quantitative Information",
        "price": 38.00,
        "author": "Edward Tufte"
    },
    {
        "title": "Practical Object-Oriented Design",
        "author": "Sandi Metz",
        "price": 30.47
    },
    {
        "title": "Weapons of Math Destruction",
        "author": "Cathy O'Neil",
        "price": 17.44
    }
]

In [3]:
books

[{'title': 'Genetic Algorithms and Machine Learning for Programmers',
  'price': 36.99,
  'author': 'Frances Buontempo'},
 {'title': 'The Visual Display of Quantitative Information',
  'price': 38.0,
  'author': 'Edward Tufte'},
 {'title': 'Practical Object-Oriented Design',
  'author': 'Sandi Metz',
  'price': 30.47},
 {'title': 'Weapons of Math Destruction',
  'author': "Cathy O'Neil",
  'price': 17.44}]

In [4]:
# Transforming a list of dictionaries w/ identical keys into a dataframe
# The keys become the columns and the values from each dictionary become the rows
books = pd.DataFrame(books)
books

                                               title  price             author
0  Genetic Algorithms and Machine Learning for Pr...  36.99  Frances Buontempo
1     The Visual Display of Quantitative Information  38.00       Edward Tufte
2                   Practical Object-Oriented Design  30.47         Sandi Metz
3                        Weapons of Math Destruction  17.44       Cathy O'Neil

In [5]:
# Len gives us the number of rows
len(books)

4

In [6]:
# .shape gives us (rows, columns)
books.shape

(4, 3)

In [7]:
# .size gives us the total number of fields, which is rows * columns
books.size

12

In [8]:
# Get the sum total of all of the prices
# dot notation is df.column_name
books.price.sum()

122.9

In [9]:
books.price

0    36.99
1    38.00
2    30.47
3    17.44
Name: price, dtype: float64

In [10]:
type(books.price)

pandas.core.series.Series

In [11]:
# bracket notation
# df["column_name"]
books["price"].sum()

122.9

In [12]:
# Get the average book price
books.price.mean()

30.725

In [13]:
# What is the highest price for a book
books.price.max()

38.0

In [15]:
books.head(2)

                                               title  price             author
0  Genetic Algorithms and Machine Learning for Pr...  36.99  Frances Buontempo
1     The Visual Display of Quantitative Information  38.00       Edward Tufte

In [16]:
books.tail(2)

                              title  price        author
2  Practical Object-Oriented Design  30.47    Sandi Metz
3       Weapons of Math Destruction  17.44  Cathy O'Neil

In [17]:
# how to access a dataframe's index series
books.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
books.index == 0

array([ True, False, False, False])

In [23]:
# Indexing 
books[books.index == 0]

                                               title  price             author
0  Genetic Algorithms and Machine Learning for Pr...  36.99  Frances Buontempo

In [24]:
books.iloc[0]

title     Genetic Algorithms and Machine Learning for Pr...
price                                                 36.99
author                                    Frances Buontempo
Name: 0, dtype: object

In [26]:
# df.column_name.idxmax() to get the index of the highest value from column_name specified
highest_price_index = books.price.idxmax()

In [36]:
highest_price_index

1

In [37]:
type(highest_price_index)

int

In [27]:
# Get the highest price book

books[books.index == highest_price_index]

                                            title  price        author
1  The Visual Display of Quantitative Information   38.0  Edward Tufte

In [30]:
highest_price = books.price.max()

In [34]:
books[books.price == highest_price]

                                            title  price        author
1  The Visual Display of Quantitative Information   38.0  Edward Tufte

In [42]:
books.iloc[highest_price_index]

title     The Visual Display of Quantitative Information
price                                               38.0
author                                      Edward Tufte
Name: 1, dtype: object

In [43]:
# Get the lowest priced book
books[books.index == books.price.idxmin()]

                         title  price        author
3  Weapons of Math Destruction  17.44  Cathy O'Neil

In [44]:
books.index == books.price.idxmin()

array([False, False, False,  True])

In [46]:
lowest_price_mask = books.index == books.price.idxmin()
books[lowest_price_mask]

                         title  price        author
3  Weapons of Math Destruction  17.44  Cathy O'Neil

In [47]:
books.index >= 2

array([False, False,  True,  True])

In [48]:
# Show me all the books with index 2 or more
books[books.index >= 2]

                              title  price        author
2  Practical Object-Oriented Design  30.47    Sandi Metz
3       Weapons of Math Destruction  17.44  Cathy O'Neil

In [50]:
sandi_metz_dataframe = books[books.author == "Sandi Metz"]

In [52]:
books[books.author.str.contains("di Metz")]

                              title  price      author
2  Practical Object-Oriented Design  30.47  Sandi Metz

In [53]:
x = pd.Series(range(1, 11))
x >= 5

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [54]:
x[x >= 5]

4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## An Example Dataframe 

The code below will create a data frame that represents grades for multiple students. We pass a dictionary where the keys will correspond to the names of the columns, and the values associated with those keys will make up the data. We will talk in more detail about different ways to create a dataframe in a coming lesson.

In [55]:
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

As we might expect, the dataframe stored in the `df` variable has a type of `DataFrame`.

Dataframes also have a nice, printed representation:

In [56]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

And, if we are within a jupyter notebook (or the Codeup curriculum), we can get a nice html representation of a dataframe:

In [57]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [58]:
# How to retreive specific rows by the name
df[df["name"] == "Jane"]

   name  math  english  reading
1  Jane    88       79       67

In [59]:
# What's Albert's math score?
df[df.name == "Albert"].math

8    92
Name: math, dtype: int64

In [60]:
df.name == "Albert"

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
Name: name, dtype: bool

In [61]:
albert_mask = df.name == "Albert"

In [62]:
df[albert_mask]

     name  math  english  reading
8  Albert    92       62       87

In [63]:
albert_records = df[albert_mask]

In [64]:
albert_records.math

8    92
Name: math, dtype: int64

## Summarizing Dataframes

The `.info` prints out some useful information about the dataframe:

In [65]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

The `.describe` method gives a quick summary of the numerical values in a dataframe.

In [67]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

In [68]:
df.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

## Dataframe Attributes

Dataframes have several attributes that are important to be familiar with:

- `dtypes`: the data type of each column
- `shape`: the number of rows and columns in the dataframe
- `columns`: the list of column names
- `index`: the labels for each row (usually an autogenerated number)

In [69]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

In [70]:
# tuple of (rows, columns)
df.shape

(12, 4)

In [71]:
type(df.shape)

tuple

In [72]:
# to get number of rows
df.shape[0]

12

In [73]:
# to get number of columns
df.shape[1]

4

In [74]:
# Programmatic way to access the list of column names
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [75]:
df.index

RangeIndex(start=0, stop=12, step=1)

The `.columns` attribute can be assigned to in order to change the name of the columns in the data frame. For example, if we wanted to uppercase every column name, we could do so like this:

In [76]:
[col.upper() for col in df.columns]

['NAME', 'MATH', 'ENGLISH', 'READING']

In [77]:
# How to programmatically uppercase each column name
df.columns = [col.upper() for col in df.columns]

In [78]:
df

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

For now, we'll reset the column names back to what they used to be.

In [79]:
df.columns = [col.lower() for col in df.columns]

## Subsetting Dataframes

There are a number of ways we can access certain subsets, i.e. either a restricted number of rows, columns, or both, of our dataframes.

### Accessing Multiple Columns

We can see multiple columns in the dataframe by subsetting the dataframe with a list of strings. The following two code samples are functionally equivalent.

In [82]:
# Double square brackets or a df[list_variable]
# Returns a dataframe with only the columns specified
df[['name', 'math']]

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [83]:
# We can also specify a list variable
# then do df[list_variable] to get a subset of the dataframe
name_math_columns = ['name', 'math']
df[name_math_columns]

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [85]:
math_df = df[name_math_columns]

In [86]:
math_df.head(3)

    name  math
0  Sally    62
1   Jane    88
2  Suzie    94

### Accessing Individual Columns

Each column in a dataframe is a `Series` that we discussed in the previous lesson. These values can be accessed in one of two ways:

In [87]:
df.math

0     62
1     88
2     94
3     98
4     77
5     79
6     82
7     93
8     92
9     69
10    92
11    92
Name: math, dtype: int64

In [88]:
df['math']

0     62
1     88
2     94
3     98
4     77
5     79
6     82
7     93
8     92
9     69
10    92
11    92
Name: math, dtype: int64

In [89]:
# Bracket syntax is the way to go when your column name is behind a variable
column_of_interest = "math"
df[column_of_interest] # to show that column/Series

0     62
1     88
2     94
3     98
4     77
5     79
6     82
7     93
8     92
9     69
10    92
11    92
Name: math, dtype: int64

In general, the first way is preferred, but the second way is required if the name of the column is not a valid python identifier.

### Accessing Row Subsets

Pandas provides several convenience methods for quickly looking at several rows in a dataframe:

- `.head`: for the first n (default 5) rows
- `.tail`: for the last n (default 5) rows
- `.sample`: for a random sample of rows

In [90]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

In [93]:
df.tail(3)

       name  math  english  reading
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [103]:
df.sample(4)

      name  math  english  reading
5     John    79       76       93
2    Suzie    94       74       95
3    Billy    98       96       88
9  Richard    69       80       94

Like numpy arrays and pandas `Series`, pandas dataframes can also be indexed into with a boolean series.

For example, suppose we wanted to find the observations in our dataframe where the math grade is below an 80. We know that we can produce a boolean series of values using a vectorized comparison operation:

In [104]:
df.math < 80

0      True
1     False
2     False
3     False
4      True
5      True
6     False
7     False
8     False
9      True
10    False
11    False
Name: math, dtype: bool

We can then use that series to index into our dataframe to find the entire row where our condition is true:

In [105]:
# Indexing syntax
# df[df.column operator operand]
# Filter out only the rows where the math grade is less than 80
df[df.math < 80]

      name  math  english  reading
0    Sally    62       85       80
4      Ada    77       92       98
5     John    79       76       93
9  Richard    69       80       94

In [106]:
# Return the rows where the student's math score is below 80 OR their reading is above 90
# df[(mask1) | (mask2)]
# df[(df.column1 < 80) | (df.column2 > 90)]
df[(df.math < 80) | (df.reading > 90)]

       name  math  english  reading
0     Sally    62       85       80
2     Suzie    94       74       95
4       Ada    77       92       98
5      John    79       76       93
9   Richard    69       80       94
10    Isaac    92       99       93

In [107]:
# Return the rows where the student's math score is below 80 AND their reading is above 90
# df[(mask1) & (mask2)]
# df[(df.column1 < 80) & (df.column2 > 90)]
df[(df.math < 80) & (df.reading > 90)]

      name  math  english  reading
4      Ada    77       92       98
5     John    79       76       93
9  Richard    69       80       94

In [108]:
# Yet another way to specify boolean masks with OR | and and & is to use variables for the masks
# If we have variables holding our masks, the extra parens are unnecessary
math_less_than_80 = df.math < 80
reading_greater_than_90 = df.reading > 90
df[math_less_than_80 & reading_greater_than_90]

      name  math  english  reading
4      Ada    77       92       98
5     John    79       76       93
9  Richard    69       80       94

## Dropping and Renaming Columns

We can drop columns with the `.drop` method, and, similarly, rename them with `.rename`.

For both methods (and many other methods within pandas), the original dataframe **will not be changed**. Instead, the methods will produce a new dataframe. This is similar to the behavior we have seen with, for example, string methods. The exception to this is that most pandas methods will accept an optional keyword argument of `inplace` (defaults to `False`) to determine whether to mutate the original value.

Let's take a look at a couple of examples of `.drop` and `.rename`:

In [109]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [110]:
df.drop(columns=['name'])

    math  english  reading
0     62       85       80
1     88       79       67
2     94       74       95
3     98       96       88
4     77       92       98
5     79       76       93
6     82       64       81
7     93       63       90
8     92       62       87
9     69       80       94
10    92       99       93
11    92       62       72

In [111]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [114]:
# copy of original dataframe
# If you ever need to make a verbatim copy of a dataframe use .copy()
# Otherwise, both variables with point the same dataframe in memory if you do copy = df, for example
copy = df.copy()

In [115]:
# .drop returns a copy, so reassigning is the 1st way to hold the new copy
copy = copy.drop(columns=['english', 'reading'])
copy

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [116]:
# Inplace mutates the dataframe
# If you accidentally run inplace=True multiple times, you get an error because the column is already gone!
copy.drop(columns=["math"], inplace=True)

In [117]:
copy

       name
0     Sally
1      Jane
2     Suzie
3     Billy
4       Ada
5      John
6    Thomas
7     Marie
8    Albert
9   Richard
10    Isaac
11     Alan

In [118]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [119]:
# df.rename returns a copy, so you reassign if you need the reassignment (or use inplace).
# either reassign or inplace=True, but not both
# .rename(columns={"old_name1": "new_name1", "old_name2": "new_name2"})
df.rename(columns={'name': 'student', 'math': 'mathematics'})

    student  mathematics  english  reading
0     Sally           62       85       80
1      Jane           88       79       67
2     Suzie           94       74       95
3     Billy           98       96       88
4       Ada           77       92       98
5      John           79       76       93
6    Thomas           82       64       81
7     Marie           93       63       90
8    Albert           92       62       87
9   Richard           69       80       94
10    Isaac           92       99       93
11     Alan           92       62       72

We will use the `columns` keyword argument with both `.drop` and `.rename`. We'll pass a list of column names we want to remove to `.drop`, and a dictionary of columns to rename to `.rename`. Within the passed dictionary, the keys will be the old column names, and the values are the new column names.

Notice that, after both of these operations, the original variable is unchanged.

In [120]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

Because these methods each return a dataframe, we can *chain* them together:

In [121]:
# method chains.look().like().this()
# method chains read from left to right
# 1st we drop english and reading, then we rename the "name" column to "student"
df.drop(columns=['english', 'reading']).rename(columns={'name': 'student'})

    student  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

## Creating New Columns

We can add new columns to our dataframe in one of several ways. Most commonly, we will be creating a new column based on the contents of another column.

For example, let's say we wanted to create a new boolean column that indicates whether each student is passing math. We know that we can create the boolean values like this:

In [122]:
df.math >= 70

0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9     False
10     True
11     True
Name: math, dtype: bool

To add this column to our dataframe, we can the assignment operator and reference a new column in the dataframe like this:

In [123]:
df['passing_math']

KeyError: 'passing_math'

In [124]:
# dataframe["new_column_name"] = a result of other computation or comparison
df['passing_math'] = df.math > 70

We'll now see that we have an additional column in our dataframe:

In [125]:
df

       name  math  english  reading  passing_math
0     Sally    62       85       80         False
1      Jane    88       79       67          True
2     Suzie    94       74       95          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
5      John    79       76       93          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
9   Richard    69       80       94         False
10    Isaac    92       99       93          True
11     Alan    92       62       72          True

In [126]:
# Since passing_math is a series of booleans, we don't need another comparison
df[df.passing_math]

      name  math  english  reading  passing_math
1     Jane    88       79       67          True
2    Suzie    94       74       95          True
3    Billy    98       96       88          True
4      Ada    77       92       98          True
5     John    79       76       93          True
6   Thomas    82       64       81          True
7    Marie    93       63       90          True
8   Albert    92       62       87          True
10   Isaac    92       99       93          True
11    Alan    92       62       72          True

In [127]:
df.passing_math.sum()

10

In [128]:
df.passing_math.mean()

0.8333333333333334

We can also create new columns with the `.assign` method. Like other dataframe methods, `.assign` will return us a new dataframe, and not modify the existing dataframe. `.assign` takes in keyword arguments, and the names of the keyword arguments will become the new column names.

For example, to add another column indicating whether each student is passing english, we could use `.assign`:

In [129]:
# df.assign(new_column_name = whatever it takes to produce a new column)
df.assign(passing_english=df.english >= 70)

       name  math  english  reading  passing_math  passing_english
0     Sally    62       85       80         False             True
1      Jane    88       79       67          True             True
2     Suzie    94       74       95          True             True
3     Billy    98       96       88          True             True
4       Ada    77       92       98          True             True
5      John    79       76       93          True             True
6    Thomas    82       64       81          True            False
7     Marie    93       63       90          True            False
8    Albert    92       62       87          True            False
9   Richard    69       80       94         False             True
10    Isaac    92       99       93          True             True
11     Alan    92       62       72          True            False

In [130]:
df["school"] = "S.A. HS"
df

       name  math  english  reading  passing_math   school
0     Sally    62       85       80         False  S.A. HS
1      Jane    88       79       67          True  S.A. HS
2     Suzie    94       74       95          True  S.A. HS
3     Billy    98       96       88          True  S.A. HS
4       Ada    77       92       98          True  S.A. HS
5      John    79       76       93          True  S.A. HS
6    Thomas    82       64       81          True  S.A. HS
7     Marie    93       63       90          True  S.A. HS
8    Albert    92       62       87          True  S.A. HS
9   Richard    69       80       94         False  S.A. HS
10    Isaac    92       99       93          True  S.A. HS
11     Alan    92       62       72          True  S.A. HS

In [131]:
df["school"] = "Codeup"
df

       name  math  english  reading  passing_math  school
0     Sally    62       85       80         False  Codeup
1      Jane    88       79       67          True  Codeup
2     Suzie    94       74       95          True  Codeup
3     Billy    98       96       88          True  Codeup
4       Ada    77       92       98          True  Codeup
5      John    79       76       93          True  Codeup
6    Thomas    82       64       81          True  Codeup
7     Marie    93       63       90          True  Codeup
8    Albert    92       62       87          True  Codeup
9   Richard    69       80       94         False  Codeup
10    Isaac    92       99       93          True  Codeup
11     Alan    92       62       72          True  Codeup

## Sorting Dataframes

We can use the `.sort_values` method to sort a dataframe by any given criteria. For example, we can sort by the english grade:

In [132]:
# df.sort_values(by=string_name_of_a_column)
df.sort_values(by='english')

       name  math  english  reading  passing_math  school
8    Albert    92       62       87          True  Codeup
11     Alan    92       62       72          True  Codeup
7     Marie    93       63       90          True  Codeup
6    Thomas    82       64       81          True  Codeup
2     Suzie    94       74       95          True  Codeup
5      John    79       76       93          True  Codeup
1      Jane    88       79       67          True  Codeup
9   Richard    69       80       94         False  Codeup
0     Sally    62       85       80         False  Codeup
4       Ada    77       92       98          True  Codeup
3     Billy    98       96       88          True  Codeup
10    Isaac    92       99       93          True  Codeup

We can sort in descending order by providing the a keyword arugment

In [133]:
# ascending = False argument sets descending
df.sort_values(by='english', ascending=False)

       name  math  english  reading  passing_math  school
10    Isaac    92       99       93          True  Codeup
3     Billy    98       96       88          True  Codeup
4       Ada    77       92       98          True  Codeup
0     Sally    62       85       80         False  Codeup
9   Richard    69       80       94         False  Codeup
1      Jane    88       79       67          True  Codeup
5      John    79       76       93          True  Codeup
2     Suzie    94       74       95          True  Codeup
6    Thomas    82       64       81          True  Codeup
7     Marie    93       63       90          True  Codeup
8    Albert    92       62       87          True  Codeup
11     Alan    92       62       72          True  Codeup

## Chaining Dataframe Methods

Because most dataframe methods return another dataframe, it is common to see them *chained* together.

For example, we could use method chaining to find the name of the student with the *lowest* english grade above a 90.

In [135]:
# Simple Chaining Example
# Chainging reads from left to right
"hello".capitalize().swapcase()

'hELLO'

In [136]:
# we can chain df methods if each method returns a dataframe (or another datatype)
# Chaining reads from left to right
df[df.english > 90].sort_values(by='english').head(1).name

4    Ada
Name: name, dtype: object

In [141]:
plus_90 = df[df.english > 90]
plus_90

     name  math  english  reading  passing_math  school
3   Billy    98       96       88          True  Codeup
4     Ada    77       92       98          True  Codeup
10  Isaac    92       99       93          True  Codeup

In [143]:
plus_90_sorted = plus_90.sort_values(by="english")
plus_90_sorted

     name  math  english  reading  passing_math  school
4     Ada    77       92       98          True  Codeup
3   Billy    98       96       88          True  Codeup
10  Isaac    92       99       93          True  Codeup

In [144]:
plus_90_sorted_lowest = plus_90_sorted.head(1)
plus_90_sorted_lowest

  name  math  english  reading  passing_math  school
4  Ada    77       92       98          True  Codeup

In [145]:
plus_90_sorted_lowest.name

4    Ada
Name: name, dtype: object

Let's break down the above expression piece by piece:

1. `df`: our initial variable that holds our dataframe
1. `[df.english > 90]`: here we subset the datframe to find just the rows where the english grade is greater than 90
1. `.sort_values(by='english')`: now we take the remaining rows and sort them by the english grade
1. `.head(1)`: take just the first record. Because we sorted previously, this will give us the student with lowest english grade
1. `.name`: extract just the `name` part of the record

## Further Reading

- [pandas documentation: `DataFrame`s](https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#dataframe)